# Homebrew Bundle, list of all brew/cask apps
# run ./brew.sh or "brew bundle --describe"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "azure/functions"
tap "homebrew/cask-fonts"
tap "romkatv/powerlevel10k"
brew "speedtest-cli"
brew "git"                                  # Dev tool
brew "git-extras"                           # Extra git commands for productivity / reporting
brew "gnu-sed"                              # Dev tool (req)
brew "graphviz"                             # Lib to visualize data
brew "mas"                                  # Mac App store app to download existing apps
brew "mitmproxy"                            # Free proxy for analyzing web traffic (like Fiddler)
brew "nmap"                                 # Network utility
brew "node", link: false                    # Nodejs language tools
brew "npm"                                  # Node Package Manager
brew "nvm"                                  # Node Version Manager
brew "pandoc"                               # File format converter
brew "python3"                              # Python 3 including pip3
brew "pyenv"                                # Create virtual environments for Python3
brew "powerlevel10k"                        # Powerlevel10k for the best UX in iTerm2
brew "shpotify"                             # CLI for Spotify on Mac
brew "tldr"                                 # simple, community-drive man pages
brew "tree"                                 # Tree visualization for directories
brew "typescript"                           # Typescript language tools
brew "yarn"                                 # JS/Node package
brew "yarn-completion"                      # Statement completion for Yarn
brew "wget"                                 # File download
brew "youtube-dl"                           # CLI to download Youtube videos
brew "zsh"                                  # ZSH
brew "utf8proc"
brew "zsh-syntax-highlighting"              # ZSH syntax highlighting
brew "zsh-autosuggestions"                  # ZSH suggestions
brew "zlib"                                 # zlib


cask "appcleaner"                           # Thorough app cleaner
cask "apparency"                            # Checking security of an app
cask "autopkgr"                             # Autopkgr
cask "balenaetcher"                         # Create bootable ISO
cask "betterdisplay"                        # Higher resolutions
cask "disk-inventory-x"                     # Check what's taking up space on your Mac
cask "devutils"                             # Dictionary for developer utilities
cask "fsmonitor"                            # Check the filesystem
cask "firefox"                              # Firefox browser
cask "google-chrome"                        # Chrome browser
cask "iina"                                 # Play-everything media player
cask "iterm2"                               # Terminal Window app
cask "mactracker"                           # Database of Macs
cask "keepingyouawake"                      # Keeps MacOS from going to sleep indefinitely
cask "keka"                                 # Archive utility
cask "knockknock"                           # See what's persistently installed on your Mac
cask "launchcontrol"                        # Create your own LaunchDaemons/LaunchAgents
cask "lockdown"                             # Audits and remediates security configuration settings
cask "lockrattler"                          # Quick check of your security systems
cask "microsoft-office"                     # Microsoft Office
cask "packages"                             # Create custom packages
cask "postman"                              # Powerful API tool
cask "profilecreator"                       # Create macOS Configuration Profiles
cask "powershell"                           # PowerShell CLI
cask "raycast"                              # Replacement for Spotlight
cask "slack"                                # Slack client
cask "spotify"                              # Music service
cask "suspicious-package"                   # Inspect Mac app packages before installing
cask "visual-studio-code"                   # Visual Studio Code IDE
cask "whatsapp"                             # Whatsapp desktop client
cask "microsoft-office"                     # Microsoft Office
mas "Magnet", id: 441258766                 # Install Magnet
mas "Poolside FM", id: 1514817810           # PoolSide FM
mas "Blackmagic Disk Speed", id: 425264550  # BlackMagic Disk Speed
mas "Keynote", id: 409183694                # Keynote
mas "Pages", id: 409201541                  # Pages
mas "InstaCal", id: 1247292524              # InstaCal